Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་སྲུང་སྟེ།
en: Chapter 57 “Moreover, Subhūti, when bodhisattva great beings practice the perfection of ethical discipline, commencing from the time when they first begin to set their mind on enlightenment, they maintain ethical discipline through focusing their attention with all-aspect omniscience in mind.

source: དེ་ལ་འདོད་ཆགས་ཀྱི་སེམས་སྒྲིབ་པར་མི་འགྱུར།
en: Thoughts of desire do not obscure them.

source: ཞེ་སྡང་སྒྲིབ་པར་མི་འགྱུར།
en: Hatred does not obscure them.

source: གཏི་མུག་སྒྲིབ་པར་མི་འགྱུར།
en: Delusion does not obscure them.

source: བག་ལ་ཉལ་བ་སྒྲིབ་པར་མི་འགྱུར།
en: Latent impulses do not obscure them.

source: ཀུན་ནས་ལྡང་བ་སྒྲིབ་པར་མི་འགྱུར་ཏེ།
en: Obsessions do not obscure them.

source: མི་དགེ་བའི་ཆོས་གཞན་བྱང་ཆུབ་ཀྱི་བགེགས་སུ་འགྱུར་བ་འདི་ལྟ་སྟེ། སེར་སྣ་འམ།
en: Other nonvirtuous attributes that might impede enlightenment also do not obscure them.

source: ཚུལ་ཁྲིམས་ངན་པ་འམ། འཁྲུག་པའི་སེམས་སམ། ལེ་ལོའི་སེམས་སམ། བརྩོན་འགྲུས་ཆུང་བའི་སེམས་སམ། གཡེང་བའི་སེམས་སམ།
en: These include miserliness, degenerate morality, thoughts of anger, thoughts of indolence, thoughts of irresolution, thoughts of distraction, thoughts of stupidity, {Ki.

source: ཤེས་རབ་འཆལ་བའི་སེམས་སམ་ང་རྒྱལ་ལམ། བརྙས་པ་འམ་ཆེ་བའི་ང་རྒྱལ་ལམ་ངའི་ང་རྒྱལ་ལམ། ཉན་ཐོས་ཀྱི་སེམས་སམ། རང་སངས་རྒྱས་ཀྱི་སེམས་དག་ཀྱང་སྒྲིབ་པར་མི་འགྱུར་རོ།
en: V: 145} pride, contempt, exalted pride, egotistical pride, the mindset of the śrāvakas, and the mindset of the pratyekabuddhas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་ཤིང་། ཆོས་ཐམས་ཅད་མེད་པ་དང་། མ་བྱུང་བ་དང་། ཡོངས་སུ་མ་རྫོགས་པ་དང་།
en: If you ask why, Subhūti, it is because in this way they know that all phenomena are empty of their own defining characteristics, and they see that all phenomena are nonexistent, unoriginated, unconsummated, and not brought into being.

source: མངོན་པར་མ་གྲུབ་པར་མཐོང་སྟེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་མཚན་ཉིད་ལ་འཇུག་ན་ཡང་། ཆོས་ཐམས་ཅད་ནི་ནུས་པ་གང་ཡང་མེད་པའོ། །ཞེས་བྱ་བར་འདུ་བྱེད་མེད་པའི་མཚན་ཉིད་ཀྱིས་འཇུག་སྟེ།
en: Although they penetrate the defining characteristics of all phenomena, they do so through defining characteristics that are unconditioned, in that all phenomena are said to be utterly ineffectual.

source: དེ་ཐབས་ལ་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས་ན། དགེ་བའི་རྩ་བས་རྣམ་པར་འཕེལ་བར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ།
en: Since they are endowed with such skill in means, they practice the perfection of ethical discipline while increasing their roots of virtuous action.

source: དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ཀྱང་།
en: Practicing the perfection of ethical discipline, they bring beings to maturity and refine the buddhafields.

source: གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་དང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་གཏོགས་པར། ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་གང་འཁོར་བར་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་དེ་ལྟ་བུའི་འབྲས་བུ་ལ་སྨོན་པ་མེད་དོ།
en: But other than that, in practicing the perfection of ethical discipline in order that they might protect all beings and bring beings to maturity, they do not aspire for other fruits of their ethical discipline, such that they would enjoy in cyclic existence. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་བཟོད་པ་སྒོམ་སྟེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of tolerance, commencing from the time when they first begin to set their mind on enlightenment, they cultivate tolerance through focusing their attention with all-aspect omniscience in mind.

source: །ཞེ་སྡང་སྒྲིབ་པར་མི་འགྱུར།
en: Hatred does not obscure them.

source: གཏི་མུག་སྒྲིབ་པར་མི་འགྱུར་བག་ལ་ཉལ་བ་སྒྲིབ་པར་མི་འགྱུར་ཀུན་ནས་ལྡང་བ་སྒྲིབ་པར་མི་འགྱུར་ཏེ།
en: Delusion does not obscure them. Latent impulses do not obscure them. Obsessions do not obscure them.

source: མི་དགེ་བའི་ཆོས་གཞན་གང་བྱང་ཆུབ་ཀྱི་བགེགས་སུ་འགྱུར་བ། འདི་ལྟ་སྟེ་སེར་སྣ་འམ་ཚུལ་ཁྲིམས་ངན་པ་འམ་འཁྲུག་པའི་སེམས་སམ། ལེ་ལོའི་སེམས་སམ། བརྩོན་འགྲུས་ཆུང་བའི་སེམས་སམ།
en: Other nonvirtuous attributes that might impede enlightenment also do not obscure them.

source: གཡེང་བའི་སེམས་སམ། ཤེས་རབ་འཆལ་བའི་སེམས་སམ་ང་རྒྱལ་ལམ་བརྙས་པ་འམ། ཆེ་བའི་ང་རྒྱལ་ལམ་ངའི་ང་རྒྱལ་ལམ། ཉན་ཐོས་ཀྱི་སེམས་སམ། རང་སངས་རྒྱས་ཀྱི་སེམས་དག་ཀྱང་སྒྲིབ་པར་མི་འགྱུར་རོ།
en: These include miserliness, degenerate morality, thoughts of anger, thoughts of indolence, thoughts of irresolution, thoughts of distraction, thoughts of stupidity, pride, contempt, exalted pride, egotistical pride, the mindset of the śrāvakas, and the mindset of the pratyekabuddhas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་ཤིང་། ཆོས་ཐམས་ཅད་མེད་པ་དང་མ་བྱུང་བ་དང་། ཡོངས་སུ་མ་རྫོགས་པ་དང་། མངོན་པར་མ་གྲུབ་པར་མཐོང་སྟེ།
en: If you ask why, Subhūti, it is because in this way they know that all phenomena are empty of their own defining characteristics, and they see that all phenomena are nonexistent, unoriginated, unconsummated, and not brought into being.

source: ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་མཚན་ཉིད་ལ་འཇུག་ན་ཡང་། ཆོས་ཐམས་ཅད་ནི་ནུས་པ་གང་ཡང་མེད་པའོ། །ཞེས་བྱ་བར་འདུ་བྱེད་མེད་པའི་མཚན་ཉིད་ཀྱིས་འཇུག་སྟེ།
en: Although they penetrate the defining characteristics of all phenomena, they do so through defining characteristics that are unconditioned, in that all phenomena are said to be utterly ineffectual.

source: དེ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས་ན། དགེ་བའི་རྩ་བས་རྣམ་པར་འཕེལ་བར་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ།
en: Since they are endowed with such skill in means, they practice the perfection of tolerance while increasing their roots of virtuous action.

source: དེ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ཀྱང་།
en: Practicing the perfection of tolerance, they bring beings to maturity and refine the buddhafields.

source: གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་གཏོགས་པར་བཟོད་པའི་འབྲས་བུ་གང་འཁོར་བར་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་དེ་ལྟ་བུའི་འབྲས་བུ་ལ་སྨོན་པ་མེད་དོ།
en: But other than that, in practicing the perfection of tolerance in order that they might protect all beings and bring beings to maturity, they do not aspire for other fruits of their tolerance, such that they would enjoy in cyclic existence. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of perseverance, commencing from the time when they first begin to set their mind on enlightenment, they undertake perseverance through focusing their attention with all-aspect omniscience in mind.

source: ཞེ་སྡང་སྒྲིབ་པར་མི་འགྱུར་གཏི་མུག་སྒྲིབ་པར་མི་འགྱུར།
en: Hatred does not obscure them. Delusion does not obscure them.

source: ཀུན་ནས་ལྡང་བ་སྒྲིབ་པར་མི་འགྱུར།
en: Obsessions do not obscure them.

source: མི་དགེ་བའི་ཆོས་གཞན་བྱང་ཆུབ་ཀྱི་བགེགས་སུ་འགྱུར་བ་འདི་ལྟ་སྟེ་སེར་སྣ་འམ་ཚུལ་ཁྲིམས་ངན་པ་འམ། འཁྲུག་པའི་སེམས་སམ། ལེ་ལོའི་སེམས་སམ།
en: Other nonvirtuous attributes that might impede enlightenment also do not obscure them.

source: བརྩོན་འགྲུས་ཆུང་བའི་སེམས་སམ། གཡེང་བའི་སེམས་སམ། ཤེས་རབ་འཆལ་བའི་སེམས་སམ། ང་རྒྱལ་ལམ་བརྙས་པ་འམ་ཆེ་བའི་ང་རྒྱལ་ལམ། ངའི་ང་རྒྱལ་ལམ་ཉན་ཐོས་ཀྱི་སེམས་སམ།
en: These include miserliness, degenerate morality, thoughts of anger, thoughts of indolence, thoughts of irresolution, thoughts of distraction, thoughts of stupidity, pride, contempt, exalted pride, egotistical pride, the mindset of the śrāvakas, and the mindset of the pratyekabuddhas. {

source: རང་སངས་རྒྱས་ཀྱི་སེམས་དག་ཀྱང་།
en: Ki.

source: སྒྲིབ་པར་མི་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་ཤིང་། ཆོས་ཐམས་ཅད་མེད་པ་དང་མ་བྱུང་བ་དང་ཡོངས་སུ་མ་རྫོགས་པ་དང་། མངོན་པར་མ་གྲུབ་པར་མཐོང་སྟེ།
en: V: 146} If you ask why, Subhūti, it is because in this way they know that all phenomena are empty of their own defining characteristics, and they see that all phenomena are nonexistent, unoriginated, unconsummated, and not brought into being.

source: དེ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས་ན། དགེ་བའི་རྩ་བས་རྣམ་པར་འཕེལ་བར་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: Since they are endowed with such skill in means, they practice the perfection of perseverance while increasing their roots of virtuous action.

source: །དེ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ཀྱང་།
en: Practicing the perfection of perseverance, they bring beings to maturity and refine the buddhafields.

source: གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་གཏོགས་པར། བརྩོན་འགྲུས་ཀྱི་འབྲས་བུ་གང་འཁོར་བར་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་དེ་ལྟ་བུའི་འབྲས་བུ་ལ་སྨོན་པ་མེད་དོ།
en: But other than that, in practicing the perfection of perseverance in order that they might protect all beings and bring beings to maturity, they do not aspire for other fruits of their perseverance, such that they would enjoy in cyclic existence. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བསམ་གཏན་རྣམས་ལ་སྙོམས་པར་འཇུག་སྟེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of meditative concentration, commencing from the time when they first begin to set their mind on enlightenment, they are absorbed in meditative concentration through focusing their attention with all-aspect omniscience in mind.

source: མི་དགེ་བའི་ཆོས་གཞན་བྱང་ཆུབ་ཀྱི་བགེགས་སུ་འགྱུར་བ་འདི་ལྟ་སྟེ། སེར་སྣ་འམ་ཚུལ་ཁྲིམས་ངན་པ་འམ།
en: Other nonvirtuous attributes that might impede enlightenment also do not obscure them.

source: འཁྲུག་པའི་སེམས་སམ་ལེ་ལོའི་སེམས་སམ་བརྩོན་འགྲུས་ཆུང་བའི་སེམས་སམ། གཡེང་བའི་སེམས་སམ། ཤེས་རབ་འཆལ་བའི་སེམས་སམ། ང་རྒྱལ་ལམ་བརྙས་པ་འམ་ཆེ་བའི་ང་རྒྱལ་ལམ་ངའི་ང་རྒྱལ་ལམ། ཉན་ཐོས་ཀྱི་སེམས་སམ་རང་སངས་རྒྱས་ཀྱི་སེམས་དག་ཀྱང་སྒྲིབ་པར་མི་འགྱུར་རོ།
en: These include miserliness, degenerate morality, thoughts of anger, thoughts of indolence, thoughts of irresolution, thoughts of distraction, thoughts of stupidity, pride, contempt, exalted pride, egotistical pride, the mindset of the śrāvakas, and the mindset of the pratyekabuddhas. {

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་ཤིང་། ཆོས་ཐམས་ཅད་མེད་པ་དང་མ་བྱུང་བ་དང་། ཡོངས་སུ་མ་རྫོགས་པ་དང་། མངོན་པར་མ་གྲུབ་པར་མཐོང་སྟེ།
en: V: 147} If you ask why, Subhūti, it is because in this way they know that all phenomena are empty of their own defining characteristics, and they see that all phenomena are nonexistent, unoriginated, unconsummated, and not brought into being.

source: དེ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས་ན། དགེ་བའི་རྩ་བས་རྣམ་པར་འཕེལ་བར་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ།
en: Since they are endowed with such skill in means, they practice the perfection of meditative concentration while increasing their roots of virtuous action.

source: དེ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ཀྱང་།
en: Practicing the perfection of meditative concentration, they bring beings to maturity and refine the buddhafields.

source: གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་གཏོགས་པར། བསམ་གཏན་གྱི་འབྲས་བུ་གང་འཁོར་བར་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་དེ་ལྟ་བུའི་འབྲས་བུ་ལ་སྨོན་པ་མེད་དོ།
en: But other than that, in practicing the perfection of meditative concentration in order that they might protect all beings and bring beings to maturity, they do not aspire for other fruits of their meditative concentration, such that they would enjoy in cyclic existence. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་ཤེས་རབ་སྒོམ་སྟེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, commencing from the time when they first begin to set their mind on enlightenment, they cultivate wisdom through focusing their attention with all-aspect omniscience in mind.

source: མི་དགེ་བའི་ཆོས་གཞན་བྱང་ཆུབ་ཀྱི་བགེགས་སུ་འགྱུར་བ་འདི་ལྟ་སྟེ།
en: Other nonvirtuous attributes that might impede enlightenment also do not obscure them.

source: སེར་སྣ་འམ་ཚུལ་ཁྲིམས་ངན་པ་འམ་འཁྲུག་པའི་སེམས་སམ། ལེ་ལོའི་སེམས་སམ་བརྩོན་འགྲུས་ཆུང་བའི་སེམས་སམ། གཡེང་བའི་སེམས་སམ་ཤེས་རབ་འཆལ་བའི་སེམས་སམ། ང་རྒྱལ་ལམ་བརྙས་པ་འམ་ཆེ་བའི་ང་རྒྱལ་ལམ་ངའི་ང་རྒྱལ་ལམ་ཉན་ཐོས་ཀྱི་སེམས་སམ། རང་སངས་རྒྱས་ཀྱི་སེམས་དག་ཀྱང་སྒྲིབ་པར་མི་འགྱུར་རོ།
en: These include miserliness, degenerate morality, thoughts of anger, thoughts of indolence, thoughts of irresolution, thoughts of distraction, thoughts of stupidity, pride, contempt, exalted pride, egotistical pride, the mindset of the śrāvakas, and the mindset of the pratyekabuddhas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་ཤིང་། ཆོས་ཐམས་ཅད་མེད་པ་དང་མ་བྱུང་བ་དང་ཡོངས་སུ་མ་རྫོགས་པ་དང་མངོན་པར་མ་གྲུབ་པར་མཐོང་སྟེ།
en: If you ask why, Subhūti, it is because in this way they know that all phenomena are empty of their own defining characteristics, and they see that all phenomena are nonexistent, unoriginated, unconsummated, and not brought into being.

source: དེ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས་ན། དགེ་བའི་རྩ་བས་རྣམ་པར་འཕེལ་བར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ།
en: Since they are endowed with such skill in means, they practice the perfection of wisdom while increasing their roots of virtuous action.

source: དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ཀྱང་།
en: Practicing the perfection of wisdom, they bring beings to maturity and refine the buddhafields.

source: གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་གཏོགས་པར། ཤེས་རབ་ཀྱི་འབྲས་བུ་གང་འཁོར་བར་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་དེ་ལྟ་བུའི་འབྲས་བུ་ལ་སྨོན་པ་མེད་དོ།
en: But other than that, in practicing the perfection of wisdom in order that they might protect all beings and bring beings to maturity, they do not aspire for other fruits of their wisdom, such that they would enjoy in cyclic existence.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ལྔ་བཅུ་བདུན་པའོ།། །།
en: This completes the fifty-seventh chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: Chapter 58 Moreover, Subhūti, bodhisattva great beings become absorbed in the first meditative concentration.

source: བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: They become absorbed in the second meditative concentration.

source: བསམ་གཏན་གསུམ་པ་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: They become absorbed in the third meditative concentration.

source: བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: They become absorbed in the fourth meditative concentration.

source: ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་ཀྱང་དེ་དག་གི་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: They become absorbed in the immeasurable attitudes and the formless absorptions, but they do not hold on to the maturation of these [meditative concentrations and so forth].

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་ཐབས་མཁས་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: If you ask why, it is because they possess skill in means.

source: ཐབས་མཁས་པ་དེས་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་སོ།
en: Through this skill in means, they know that those meditative concentrations, immeasurable attitudes, and formless absorptions are empty of their own defining characteristics, {Ki.

source: །ཆོས་ཐམས་ཅད་མེད་པ་དང་མ་བྱུང་བ་དང་། ཡོངས་སུ་མ་རྫོགས་པ་དང་། མངོན་པར་མ་གྲུབ་པར་ཤེས་སོ།
en: V: 148} and they know that all phenomena are nonexistent, unoriginated, unconsummated, and not brought into being. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ཐབས་མཁས་པ་དང་ལྡན་པས་མཐོང་བ་དང་། བསྒོམ་པས་སྤང་བའི་ལམ་ལ་སྤྱོད་ཀྱང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་མི་བྱེད།
en: Moreover, Subhūti, bodhisattva great beings who possess skill in means, commencing from the time when they first begin to set their mind on enlightenment, practice the path of renunciation through insight and cultivation, but they do not attain the fruit of entering the stream to nirvāṇa.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པར་མི་བྱེད་རང་བྱང་ཆུབ་ཐོབ་པར་མི་བྱེད་དོ།
en: They do not attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or arhatship. They do not attain individual enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས། ཆོས་ཐམས་ཅད་མེད་པ་དང་མ་བྱུང་བ་དང་ཡོངས་སུ་མ་རྫོགས་པ་དང་། མངོན་པར་མ་གྲུབ་པར་ཤེས་ཏེ།
en: If you ask why, it is because they know that all phenomena are empty of their own defining characteristics and they know that all phenomena are nonexistent, unoriginated, unconsummated, and not brought into being.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དེ་དག་ལ་སྤྱོད་ཅིང་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཡོངས་སུ་འདའ་སྟེ།
en: Practicing those factors conducive to enlightenment, they transcend the level of the śrāvakas and the level of the pratyekabuddhas.

source: རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པའོ།
en: This, Subhūti, is the acceptance that phenomena are nonarising, which bodhisattva great beings have. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་སྙོམས་པར་འཇུག །མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་ཀྱང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་མི་བྱེད།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they become absorbed in the eight aspects of liberation, and they become absorbed in the nine serial steps of meditative absorption, but they do not attain the fruit of entering the stream to nirvāṇa.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཐོབ་པར་མི་བྱེད་དོ།
en: They do not attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་སོ། །ཆོས་ཐམས་ཅད་མེད་པ་དང་མ་བྱུང་བར་ཤེས་སོ། །ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་རྫོགས་པར་ཤེས་སོ། །ཆོས་ཐམས་ཅད་མངོན་པར་མ་གྲུབ་པར་ཤེས་སོ།
en: If you ask why, it is because they know that all phenomena are empty of their own defining characteristics, they know that all phenomena are nonexistent and unoriginated, they know that all phenomena are unconsummated, and they know that all phenomena are not brought into being. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད། མི་འཇིགས་པ་བཞི་དང་།
en: Moreover, Subhūti, bodhisattva great beings master the ten powers of the tathāgatas, they master the four fearlessnesses {Ki.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་ཀྱང་། ནམ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་མ་གྱུར་པ་དང་།
en: V: 149} and the four kinds of exact knowledge, they master the eighteen distinct qualities of the buddhas, and they master great loving kindness and great compassion, but they never attain all-aspect omniscience until they have refined the buddhafields and brought beings to maturity.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མ་གྱུར་གྱི་བར་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་བྱེད་དོ། །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: It is in this way, Subhūti, that bodhisattva great beings should practice the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟ་བུའི་ཆོས་ཟབ་མོ་དག་ལ་སྤྱོད་ཀྱང་། རྣམ་པར་སྨིན་པ་ཡོངས་སུ་མི་འཛིན་པ་ནི། བློ་དམ་པ་དང་ལྡན་པ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, bodhisattva great beings who practice such profound attributes but do not hold on to their maturation are of supreme intelligence!” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དེ་ལྟ་བུའི་ཆོས་ཟབ་མོ་དག་ལ་སྤྱོད་ཅིང་། རྣམ་པར་སྨིན་པ་ཡོངས་སུ་མི་འཛིན་པ་ནི་བློ་དམ་པ་དང་ལྡན་པའོ།
en: Bodhisattva great beings who practice such profound attributes but do not hold on to their maturation are of supreme intelligence.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ། །གསོལ་པ།
en: If you ask why, Subhūti, it is because bodhisattva great beings do not stir from the essential nature.” “

source: བཅོམ་ལྡན་འདས་ངོ་བོ་ཉིད་གང་ལས་མི་གཡོ་བ་ལགས།
en: Blessed Lord, from what essential nature do they not stir?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དངོས་པོ་མེད་པ་ལས་མི་གཡོ་བ་ཡིན་ཏེ།
en: They do not stir from nonentity,” replied the Blessed One. “

source: རབ་འབྱོར་གང་ཡང་འདི་སྐད་དུ་ངོ་བོ་ཉིད་གང་ལས་མི་གཡོ་ཞེས་ཟེར་བ་ནི།
en: Subhūti, with regard to that which you asked, namely, ‘From what essential nature they do not stir?’

source: གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ།
en: they do not stir from the essential nature of physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ།
en: They do not stir from the essential nature of feelings, perceptions, formative predispositions, or consciousness.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ།
en: They do not stir from the essential nature of the sense fields, the sensory elements, or the links of dependent origination.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ།
en: They do not stir from the essential nature of the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ།
en: They do not stir from the essential nature of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ།
en: They do not stir from the essential nature of the emptiness of internal phenomena, the emptiness of external phenomena, and the emptiness of external and internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ།
en: They do not stir from the essential nature of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་ངོ་བོ་ཉིད་ལས་མི་གཡོའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: They do not stir from the essential nature of the meditative concentrations, the immeasurable attitudes, and the formless absorptions.
